:PROPERTIES:
:ID:       D87B9E33-CA56-4301-A59A-6FC951966D08
:header-args: :results output
:END:
#+title: ollama

Ollama provides support for running some models (LLM/foundational) locally.

* Installation

** [[id:61678BF7-A363-45C2-A3E2-54A1EB15EF68][brew]]

#+begin_src shell :session brew :async
  brew install --yes ollama
#+end_src

#+RESULTS:
: 0e31e4eb-5475-4c9f-98b8-31ba5db23f19

#+begin_src shell
  brew services start ollama
#+end_src

#+RESULTS:
: ==> Successfully started `ollama` (label: homebrew.mxcl.ollama)

* Verification

#+begin_src shell
  ollama --version
#+end_src

#+RESULTS:
: ollama version is 0.31.1

* Help

#+begin_src shell
  ollama --help
#+end_src

#+RESULTS:
#+begin_example
Large language model runner

Usage:
  ollama [flags]
  ollama [command]

Available Commands:
  serve       Start Ollama
  create      Create a model
  show        Show information for a model
  run         Run a model
  stop        Stop a running model
  pull        Pull a model from a registry
  push        Push a model to a registry
  signin      Sign in to ollama.com
  signout     Sign out from ollama.com
  list        List models
  ps          List running models
  cp          Copy a model
  rm          Remove a model
  launch      Launch the Ollama menu or an integration
  help        Help about any command

Flags:
  -h, --help         help for ollama
      --nowordwrap   Don't wrap words to the next line automatically
      --verbose      Show timings for response
  -v, --version      Show version information

Use "ollama [command] --help" for more information about a command.
#+end_example

* List

Ollama supports listing installed models - support for querying
available models should be built out using something like curl.

This list therefore reflects what I currently have on one my workstations.

** Help

#+begin_src shell
  ollama list --help
#+end_src

#+RESULTS:
#+begin_example
List models

Usage:
  ollama list [flags]

Aliases:
  list, ls

Flags:
  -h, --help   help for list

Environment Variables:
      OLLAMA_HOST                   IP Address for the ollama server (default 127.0.0.1:11434)
#+end_example

** Usage

#+begin_src shell
  ollama list
#+end_src

#+RESULTS:
: NAME                       ID              SIZE      MODIFIED    
: gemma:latest               a72c7f4d0a15    5.0 GB    8 days ago     
: nomic-embed-text:latest    0a109f422b47    274 MB    4 weeks ago    
: qwen3:latest               500a1f067a9f    5.2 GB    5 weeks ago    
: gpt-oss:latest             17052f91a42e    13 GB     7 weeks ago    

- [[id:D6EB63CC-2B15-45DC-8C49-33C0DB4DA1C5][gpt-oss]]
- [[id:265230C1-96C3-4C5B-8CE3-050F471FCFF2][qwen3]]

** TODO gemma4 seems to be a more promising default than gpt-oss...

* ps

** Help
#+begin_src shell
  ollama ps --help
#+end_src

#+RESULTS:
#+begin_example
List running models

Usage:
  ollama ps [flags]

Flags:
  -h, --help   help for ps

Environment Variables:
      OLLAMA_HOST                   IP Address for the ollama server (default 127.0.0.1:11434)
#+end_example

** Usage

#+begin_src shell
  ollama ps
#+end_src

#+RESULTS:
: NAME    ID    SIZE    PROCESSOR    CONTEXT    UNTIL 
